#include "MyPG.h"
#include "MyGameMain.h"

//ロードゲーム画面
namespace LoadGame {
	//ゲーム情報
	DG::Font::SP fontA;

	//--------------------------------------------------------------------------------------
	//初期化処理
	//機能概要：プログラム起動時に1回実行される（素材などの準備を行う）
	//--------------------------------------------------------------------------------------
	void Initialize() {
		fontA = DG::Font::Create("HGS教科書", 5, 10);
	}
	//--------------------------------------------------------------------------------------
	//解放処理
	//--------------------------------------------------------------------------------------
	void Finalize() {
		fontA.reset();
	}
	//--------------------------------------------------------------------------------------
	//更新処理
	//機能概要：ゲームの１フレームに当たる処理
	//--------------------------------------------------------------------------------------
	TaskFlag UpDate() {
		auto inp = ge->in1->GetState();
		
		TaskFlag rtv = TaskFlag::LoadGame;//とりあえず現在のタスクを指定
		if (inp.ST.down) {
			rtv = TaskFlag::Game;//次のタスクをゲーム本編へ
		}
		return rtv;
	}
	//--------------------------------------------------------------------------------------
	//描画処理
	//機能概要：ゲームの１フレームに当たる表示処理
	//--------------------------------------------------------------------------------------
	void Render() {
		ML::Box2D textBox(10, 10, 300, 200);
		string text = "ロードゲームです。セーブファイルを選んで\nそのデータでゲームを初期化します（本来は）";
		fontA->Draw(textBox, text, ML::Color(0.8f, 0.5f, 0.0f, 0.2f));
	}
}